app/controllers/api/v1/assets_controller.rb

SELECT "assets".* FROM "assets" WHERE "assets"."asset_type" = 'compost' AND "assets"."status" = 'active' LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "assets" WHERE "assets"."asset_type" = 'animal'
---
      def index
        @assets = Asset.where(asset_type: @asset_type)
        @assets = @assets.where(status: params[:filter][:status]) if params.dig(:filter, :status)

        # Handle pagination - support both page[number] and page formats
        page_number = (params.dig(:page, :number) || params[:page] || 1).to_i
        page_size = (params.dig(:page, :size) || params[:per_page] || 20).to_i

        @assets = @assets.page(page_number).per(page_size)

INSERT INTO "assets" ("name", "status", "notes", "is_location", "is_fixed", "asset_type", "archived_at", "created_at", "updated_at") VALUES ('Daisy', 'active', 'High-quality milk producer, gentle temperament', FALSE, FALSE, 'animal', NULL, '2025-07-01 16:21:08.366384', '2025-07-01 16:21:08.366384') RETURNING "id"
---
      def create
        @asset = Asset.new(asset_params)
        @asset.asset_type = @asset_type

        if @asset.save

UPDATE "assets" SET "name" = 'farm2', "updated_at" = '2025-10-22 14:57:43.219552' WHERE "assets"."id" = 7
---
      def update
        if @asset.update(asset_params)

DELETE FROM "assets" WHERE "assets"."id" = 9
---
      def destroy
        @asset.destroy

SELECT "assets".* FROM "assets" WHERE "assets"."asset_type" = 'animal' AND "assets"."id" = 8 LIMIT 1
---
      def set_asset
        @asset = Asset.where(asset_type: @asset_type).find(params[:id])