app/controllers/api/v1/assets_controller.rb

SELECT "assets"."id" FROM "assets" WHERE "assets"."parent_id" = 12
SELECT COUNT(*) FROM "assets" WHERE "assets"."parent_id" = 12
---
      def index
        @assets = Asset.where(asset_type: @asset_type)

        # Filter out archived assets by default (unless explicitly requested)
        @assets = @assets.active unless params[:archived] == "true"

        # Optional status filter (overrides default active filter)
        @assets = @assets.where(status: params[:filter][:status]) if params.dig(:filter, :status)

        # Hierarchy filters
        if params.dig(:filter, :parent_id)
          @assets = @assets.where(parent_id: params[:filter][:parent_id])
        end

        # Filter for root assets only
        if params.dig(:filter, :root_only) == "true"
          @assets = @assets.where(parent_id: nil)
        end

        # Handle pagination - support both page[number] and page formats
        if params[:page].is_a?(Hash) || params[:page].is_a?(ActionController::Parameters)
          page_number = (params[:page][:number] || 1).to_i
          page_size = (params[:page][:size] || 20).to_i
        else
          page_number = (params[:page] || 1).to_i
          page_size = (params[:per_page] || 20).to_i
        end

        @assets = @assets.page(page_number).per(page_size)