app/controllers/api/v1/elevation_controller.rb

INSERT INTO "elevation_caches" ("latitude", "longitude", "elevation", "dataset", "created_at", "updated_at") VALUES (40.1, -88.2, 218.74010208958995, 'SRTMGL3', '2025-07-02 19:42:07.527974', '2025-07-02 19:42:07.527974') RETURNING "id"
---
      def point
        lat = params[:latitude]&.to_f
        lon = params[:longitude]&.to_f
        dataset = params[:dataset] || 'SRTMGL3'

        if lat.nil? || lon.nil?
          render json: { error: "Latitude and longitude are required" }, status: :bad_request
          return
        end

        # Check cache first
        cached = ElevationCache.for_location(lat, lon, dataset).recent.first

        if cached
          render json: {
            latitude: lat,
            longitude: lon,
            elevation: cached.elevation,
            dataset: dataset,
            cached: true
          }
          return
        end

        # Get from OpenTopography service
        result = OpentopographyService.get_elevation(lat, lon, dataset)

        if result[:success]
          # Cache the result
          ElevationCache.create!(
            latitude: lat,
            longitude: lon,
            elevation: result[:elevation],
            dataset: dataset
          )