app/controllers/api/v1/locations_controller.rb

      def index
        locations = Location.all
---
SELECT "locations".* FROM "locations"

      def create
        location = Location.new(location_params)
        if location.save
---
INSERT INTO "locations" ("name", "status", "notes", "location_type", "geometry", "archived_at", "created_at", "updated_at") VALUES ('Center Field Pivot', 'active', 'Main irrigation pivot in the center field.', 'point', '{"radius":50,"longitude":-88.456,"latitude":40.123}', NULL, '2025-07-02 22:20:25.193296', '2025-07-02 22:20:25.193296') RETURNING "id"

      def update
        if @location.update(location_params)
---
UPDATE "locations" SET "archived_at" = NULL, "updated_at" = '2025-10-22 15:40:11.995381' WHERE "locations"."id" = 9