app/controllers/api/v1/logs_controller.rb

SELECT "logs".* FROM "logs" WHERE "logs"."log_type" = 'harvest' LIMIT 50 OFFSET 0
SELECT COUNT(*) FROM "logs"
---
      def index
        @logs = Log.where(log_type: @log_type)
        @logs = @logs.where(status: params[:filter][:status]) if params.dig(:filter, :status)

        # Handle pagination - support both page[number] and page formats
        page_number = (params.dig(:page, :number) || params[:page] || 1).to_i
        page_size = (params.dig(:page, :size) || params[:per_page] || 20).to_i

        @logs = @logs.page(page_number).per(page_size)

INSERT INTO "logs" ("name", "status", "notes", "log_type", "timestamp", "created_at", "updated_at") VALUES ('December Tomato Harvest', 'done', 'Excellent yield from greenhouse beds. Cherry and beefsteak varieties.', 'harvest', '2025-07-01 16:22:43.282507', '2025-07-01 16:22:43.704694', '2025-07-01 16:22:43.704694') RETURNING "id"
---
      def create
        @log = Log.new(log_params)
        @log.log_type = @log_type

        if @log.save

SELECT "logs".* FROM "logs" WHERE "logs"."log_type" = 'activity' AND "logs"."id" = 3 LIMIT 1
---
      def set_log
        @log = Log.where(log_type: @log_type).find(params[:id])